Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་ནི་འདས་པའི་དུས་ན་ཡང་ལེགས་པར་སྨྲས་པ་གསུང་བ་དང་། ལེགས་པར་སྨྲས་པ་བཞེད་པ་ཡིན་ཏེལེགས་པར་སྨྲས་པའི་དོན་གྱི་ཕྱིར། ངས་མཆོག་ཏུ་དཀའ་བ་ཇི་ལྟར་སྤྱད་པ་དེ་ཉོན་ཅིག །
en: in past times as well, and in the same way, the Tathāgata, who teaches pithy teachings, requested a pithy teaching, and I performed a magnificent austerity for the sake of a pithy teaching. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། རྒྱལ་པོའི་ཕོ་བྲང་བཞི་ལྡན་ཞེས་བྱ་བ་ན། རྒྱལ་པོ་ཤི་བི་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: “Monks, it took place in times gone by, during King Śibi’s reign in the royal palace of Catuṣka.

source: རྒྱལ་པོ་དེ་ཡང་བྱམས་པའི་རང་བཞིན་ཅན། སྙིང་རྗེ་དང་ལྡན་པ།
en: “This king was also of a loving nature and quite compassionate,

source: སེམས་ཅན་ལ་བྱམས་པའི་སྦྱིན་པ་ལ་སྲེད་པ་ཞིག་སྟེ།
en: with a love for beings, and wanted deeply to perform acts of charity.

source: དེ་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱེད་པ་ལ་ཞུགས་ཏེ།
en: He began to give gifts and make merit.

source: མལ་སྟན་འདོད་པ་ལ་ནི་མལ་སྟན་སྦྱིན་པར་བྱེད།
en: To those who wished for bedding and seats he gave bedding and seats.

source: ཡོ་བྱད་གཞན་འདོད་པ་ལ་ནི་ཡོ་བྱད་གཞན་སྦྱིན་པར་བྱེད་དོ། །
en: To those who wished for other goods, he gave other goods,

source: ནད་གསོ་བའི་ནད་བྲང་བཅས་ཏེ། ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ནས། སྨན་པ་རྣམས་དང་། ནད་གཡོག་རྣམས་བསྐོས་ཏེ།
en: and to the sick and to homes for the sick he provided everything that they needed, appointing healers and attendants.

source: བཟའ་བ་དང་བཅའ་བ་མང་པོ་དག་ཀྱང་སྟ་གོན་བྱས་ཏེ། ནམ་མཁའ་ལ་གནས་པ་དང་། ཆུ་ལ་གནས་པ་དང་། ཐང་ལ་གནས་པའི་སྲོག་ཆགས་རྣམས་ལ་སྦྱིན་པར་བྱེད་དོ། །
en: He prepared a great deal of food and drink and made gifts of it to the creatures that flew through the sky, dwelt in the water, or made their homes in the fields.

source: དེས་ཡི་དམ་འདི་ལྟ་བུ་ཡང་བཅས་ཏེ། དེང་ཕྱིན་ཅད་བདག་གིས་ཐམས་ཅད་ལ་ཐམས་ཅད་སྦྱིན་པར་བྱ་སྟེ།
en: ‘From this day forth, to all I shall give all,’ he promised.

source: འཇིག་རྟེན་དག་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་དགོད་པར་བྱའོ་ཞེས་དམ་བཅས་ནས། དེས་འཇིག་རྟེན་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་དོ། །
en: ‘I shall set the whole world on the path of the ten virtuous actions.’

source: དེར་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་པའི་ཕྱིར་སེམས་ཅན་ཕལ་ཆེར་ཤི་བའི་འོག་ཏུ་ལྷའི་ནང་དུ་སྐྱེས་ནས།
en: After they died, their embrace of the path of the ten virtuous actions was cause for the greater part of those beings to take birth among the gods,

source: དེ་དག་གིས་ལྷའི་གནས་རྣམས་གང་བར་གྱུར་ཏོ། །
en: until they began to fill all the gods’ residences.

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསམས་པ། འདི་ཅི་ཞིག་སྒྲུབ་བརྒྱ་བྱིན་དུ་འགྱུར་བ་སྒྲུབ་བམ། འོན་ཏེ་ཚངས་པར་འགྱུར་བ་སྒྲུབ་ཞིག་གུ་སྙམ་མོ། །
en: “Śakra, King of the Gods, thought, ‘What is this? Is someone practicing to attain the state of Indra, or perhaps to attain the state of Brahmā?’

source: དེ་ནས་དེས་བལྟས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྒྲུབ་ཅིང་འདུག་གོ། །
en: Śakra, King of the Gods, looked out, and saw that there was one who was practicing to attain unexcelled, total, and complete enlightenment.

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསམས་པ། ཅི་འདི་སེམས་ཅན་བརྟན་པོ་ཡིན་ནམ། འོན་ཏེ་སེམས་ཅན་མི་བརྟན་པ་ཡིན་པ་བདག་གིས་ཇེ་བརྟགས་ལ།
en: He thought, ‘I will go for a time and see for myself whether he is of firm resolve.

source: གལ་ཏེ་སེམས་ཅན་བརྟན་པོ་ཡིན་ན་ནི་མཆོད་པར་བྱའོ། །
en: If this being’s resolve is firm, I shall worship him.

source: འདི་ལྟ་སྟེ། སེམས་ཅན་བརྟན་པོ་མ་ཡིན་ན་ཡང་། འདིའི་སེམས་སྟོབས་བསྐྱེད་པར་བྱའོ་
en: If this being’s resolve is not firm, I shall steady him.’

source: སྙམ་ནས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བདག་ཉིད་སྲིན་པོའི་གཟུགས་སུ་མངོན་པར་སྤྲུལ་ནས།
en: With this in mind, Śakra, King of the Gods, emanated in the form of a rākṣasa,

source: རྒྱལ་པོ་ཤི་བིའི་ཁང་བཟངས་ཀྱི་ཆར་ཁེབས་ལ་འདུག་སྟེ། ཚིགས་སུ་བཅད་པའི་ཕྱེད་སྨྲས་པ།
en: sat on the canopy above King Śibi’s house, and spoke half a verse:

source: ཀྱེ་མ་འདུ་བྱེད་རྣམས་མི་རྟག །སྐྱེ་ཞིང་འཇིག་པའི་ཆོས་ཅན་ཡིན། །
en: “ ‘Sad that once formed, nothing can last, But only arise and expire . . . .’

source: ཞེས་སྨྲས་ནས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་མི་མ་ཡིན་པའི་ཆ་ལུགས་ཅན་ཅང་མི་ཟེར་བར་འདུག་གོ། །
en: “With that, Śakra, King of the Gods, in his nonhuman guise fell silent.

source: དེ་ནས་རྒྱལ་པོ་ཤི་བིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་མི་མ་ཡིན་པའི་ཆ་ལུགས་ཅན་གྱིས་ཚིག་དེ་ལྟ་བུ་བརྗོད་པ་ཐོས་སོ། །ཐོས་ནས་ཀྱང་དེས་བསམས་པ།
en: “Now King Śibi heard what Śakra, King of the Gods, in nonhuman guise had said, and when he heard it he thought,

source: གཅིག་ཏུ་ན་ནི་མྱ་ངན་ལས་འདས་པའི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་སྒོ་ཕྱེའོ། །
en: ‘This alone is the foundation of nirvāṇa and opens the gate of dependent origination.

source: གཅིག་ཏུ་ན་ནི་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ལམ་བསྟན་ཏོ་སྙམ་མོ། །
en: This alone shows the path to unexcelled, total, and complete enlightenment.’

source: དེ་ནས་རྒྱལ་པོ་ཤི་བིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་མི་མ་ཡིན་པའི་ཆ་ལུགས་ཅན། ཁང་བཟངས་ཀྱི་ཆར་ཁེབས་ལ་འདུག་པ་མཐོང་ངོ་། །
en: “King Śibi saw Śakra, King of the Gods, in nonhuman guise sitting on the canopy above his house,

source: མཐོང་ནས་ཀྱང་སྐྱེན་པར་ལངས་ནས།
en: and when he saw him he rose quickly,

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་མི་མ་ཡིན་པའི་ཆ་ལུགས་ཅན་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། སྨྲས་པ།
en: bowed with palms pressed together toward Śakra, King of the Gods, in nonhuman guise, and said,

source: གྲོགས་པོ་ཚིགས་སུ་བཅད་པ་དེ་ཚང་བར་སྨྲོས་ཤིག་དང་།
en: ‘Speak, my friend, complete the verse.

source: བདག་གིས་སློབ་མ་བགྱིས་ཏེ་མཉན་ཏོ། །
en: I will be your disciple, and listen.’

source: བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། ཁྱོད་ཀྱིས་བདག་གི་སློབ་མ་བྱས་པས་ཅི་ལ་ཕན།
en: “ ‘What good is it, if you’re my disciple?’ Śakra, King of the Gods, asked.

source: བདག་ནི་བཀྲེས་ཤིང་སྐོམ་པས་གཟིར་ཏེ། ཅི་ཟ་གཏོལ་མེད་པར་བླ་ཞིང་འདུག་གོ། །
en: ‘Tormented by hunger and thirst, I sit and speak in desperate uncertainty of what I shall eat.’

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། གྲོགས་པོ་ཚིགས་སུ་བཅད་པ་ཚང་བར་སྨྲོས་ཤིག་དང་།
en: “ ‘Speak, my friend, complete the verse,’ the Bodhisattva urged him.

source: བདག་གིས་ཁྱོད་ཁ་ཟས་ཀྱིས་ཚིམ་པར་བྱའོ། །
en: ‘I shall give you your fill of food.’

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་མི་མ་ཡིན་པའི་ཆ་ལུགས་ཅན་གྱིས་སྨྲས་པ།
en: “Śakra, King of the Gods, in nonhuman guise replied,

source: གྲོགས་པོ་ཁྱོད་ཀྱིས་ང་ཁ་ཟས་ཀྱིས་ཚིམ་པར་བྱེད་ནུས་སམ།
en: ‘My friend, how can you give me my fill?

source: ངའི་ཁ་ཟས་དང་སྐོམ་ཇི་ལྟ་བུ་ཡིན་པ་དེ་ནི་ཁྱོད་ཀྱིས་སྦྱིན་པར་དཀའོ། །
en: Being what they are, my food and drink will be difficult for you to give.’

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། ཁྱོད་ཀྱི་ཟས་སྐོམ་ཅི་ཡིན།
en: “ ‘What are your food and drink?’ the Bodhisattva asked.

source: དེས་སྨྲས་པ། མི་འཕྲལ་དུ་བསད་པའི་ཤ་དྲོན་མོ་ནི་ཟ། ཁྲག་དྲོན་མོ་ནི་འཐུང་ངོ་། །
en: “ ‘I eat the flesh and drink the warm blood of humans freshly killed,’ he replied.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་བསམས་པ།
en: “Thereupon the Bodhisattva thought,

source: དེ་ལྟ་བུའི་ཤ་ཁྲག་ནི་གསོད་པར་མ་བྱས་ཀྱི་བར་དུ་མི་རྙེད་ལ།
en: ‘That kind of flesh and blood can’t be had without killing.

source: བདག་གིས་ལེགས་པར་སྨྲས་པའི་དོན་གྱི་ཕྱིར་སེམས་ཅན་གཞན་སུ་ལ་ཡང་གནོད་པར་བྱེད་མི་ཕོད་དོ་སྙམ་ནས་
en: I can’t do harm to another being for the sake of a pithy teaching.’

source: སྨྲས་པ། གལ་ཏེ་བདག་གི་ཤ་ཁྲག་ཁྱོད་ཟ་ཞིང་འཐུང་ཕོད་ན་ནི་གྲོགས་པོ་བདག་གིས་སྦྱིན་ནུས་ཆེས་ཀྱིས།
en: So he said, ‘If you can eat and drink my flesh and blood, my friend, I can give you all the more.

source: ཚིགས་སུ་བཅད་པ་ཚང་བར་སྨྲོས་ཤིག་དང་།
en: Therefore, speak, and complete the verse.

source: ལེགས་པར་སྨྲས་པའི་དོན་གྱི་ཕྱིར་བདག་གིས་ཁྱོད་ལ་རང་གི་ཤ་ཁྲག་སྦྱིན་ནོ། །
en: For your pithy teaching I shall give you my own flesh and blood.’

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཚིགས་སུ་བཅད་པ་ཚང་བར་སྨྲས་པ།
en: “Thereupon Śakra, King of the Gods spoke, completing the verse:

source: ཀྱེ་མ་འདུ་བྱེད་རྣམས་མི་རྟག །སྐྱེ་ཞིང་འཇིག་པའི་ཆོས་ཅན་ཡིན། །སྐྱེས་ནས་འགག་པར་འགྱུར་བ་སྟེ། །
en: “ ‘Sad that once formed, nothing can last, But only arise and expire. Sad that once born, all things must cease.

source: དེ་དག་ཉེ་བར་ཞི་བ་བདེ། །
en: Their pacification is bliss.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་ཚིགས་སུ་བཅད་པ་ཚང་བ་དེ་གུས་པར་མནོས་ནས། ཡུན་རིང་པོ་ཞིག་ཏུ། ཁ་ཏོན་དུ་སྦྱངས་ནས་བསམས་པ།
en: “In reverence the Bodhisattva pondered the entire verse, and for a long time he practiced reciting it, thinking,

source: འདི་ནི་མྱ་ངན་ལས་འདས་པའི་གྲོང་ཁྱེར་གྱི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་སྒོ་ཡིན་ནོ། །
en: ‘This is the foundation of the city of nirvāṇa and the gate of dependent arising.

source: འདི་ནི་མྱ་ངན་ལས་འདས་པའི་གྲོང་ཁྱེར་གྱི་ལམ་ཡིན་ནོ། །
en: It is the path that leads to the city of nirvāṇa,

source: ལམ་འདིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ངེས་པར་འབྱུང་ངོ་སྙམ་ནས།
en: the path by which every totally and complete awakened buddha has gone forth.’

source: མཚོན་ཆ་རྣོན་པོ་བླངས་ཏེ་སྨྲས་པ།
en: Taking up a very sharp knife, he said,

source: གྲོགས་པོ་ལེགས་པར་སྨྲས་པའི་དོན་གྱི་ཕྱིར་ཡོན་བཞེས་ཤིག་ཅེས་བྱས་ནས།
en: ‘An offering for your pithy teaching, my friend,’

source: བྲང་གི་ཕྱོགས་གཅིག་ནས་ཤ་བཅད་དེ། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་མི་མ་ཡིན་པའི་ཆ་ལུགས་ཅན་ལ་བྱིན་ཏེ་
en: and to Śakra, King of the Gods, in nonhuman guise he handed flesh cut from his side.

source: སྨྲས་པ། གྲོགས་པོ་འགྲངས་སམ། དེས་སྨྲས་པ། མ་འགྲངས་སོ། །
en: “ ‘My friend, will this satisfy you?’ he asked. “ ‘No,’ came the reply. ‘It will not.’

source: དེ་བཞིན་དུ་བྲང་གི་ཕྱོགས་ཡ་གཅིག་ནས་ཤ་བཅད་དེ་བྱིན་ནོ། །
en: “So he handed him flesh cut from his other side,

source: དེ་བཞིན་དུ་དཔུང་པའི་ཤ་རྣམས་དང་། ལུས་ཐམས་ཅད་ཀྱི་ཤ་བཅད་ཅིང་བྱིན་ནས་སྨྲས་པ།
en: and in the same way flesh cut from his shoulders and cut from all over his body, asking,

source: གྲོགས་པོ་འགྲངས་སམ། དེས་སྨྲས་པ། མ་འགྲངས་སོ། །
en: ‘My friend, will this satisfy you?’ “ ‘No,’ came the reply. ‘It will not.’

source: ད་ནི་ལུས་རིལ་གྱིས་ཡོངས་སུ་གཏང་བའི་དུས་ཁོ་ན་ལ་བབ་བོ་སྙམ་ནས།
en: ‘The time is here at last to completely let go of my whole body,’

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན། བདག་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་གྱུར་ཅིག་ཅེས་བྱས་ནས
en: ‘By this root of virtue, may I become a protector for the world’s blind who are without a guide, without any guide at all, without anyone to show them the way—a tathāgata, an arhat, a totally and completely awakened buddha endowed with perfect knowledge and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—a blessed buddha.’

source: སྦྱིན་པ་ཆེན་པོར་གྱུར་པ་འདི་ཡིས་ནི། །སྲིད་པ་དག་ཏུ་རང་བྱུང་སངས་རྒྱས་ཤོག །
en: “ ‘By this great gift may I become A self-arisen buddha for all the worlds.

source: སྔོན་གྱི་རྒྱལ་དབང་རྣམས་ཀྱིས་མ་བསྒྲལ་བའི། །སྐྱེ་བོ་ཕལ་ཆེན་བརྒལ་ནས་བསྒྲལ་བར་བགྱི། །
en: May I rescue and liberate the many beings Not liberated by the victorious lords who came before me.’

source: དེ་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་ནས། སྨྲས་པ།
en: “Having thus prayed for unexcelled, total, and complete enlightenment, he said,

source: གྲོགས་པོ་བདག་གིས་ལུས་འདི་ཅི་ལྟར་དགའ་བར་གྱིས་ཤིག །
en: ‘My friend, you may do as you please with my body.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་སེམས་བསྐྱེད་མ་ཐག་ཏུ་ས་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །
en: No sooner had the Bodhisattva conceived the spirit of enlightenment than the earth quaked six different ways.

source: ནམ་མཁའ་ལ་འཁོད་པའི་ལྷ་རྣམས་ཀྱིས་ཀྱང་མེ་ཏོག་གི་ཆར་ཕབ་ནས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། གྲོགས་པོ་ལེགས་སོ། །
en: The gods who lived in the sky let fall a rain of flowers and said, ‘How good, friend,

source: ལེགས་སོ་ཁྱོད་ཀྱིས་མཆོག་ཏུ་དཀའ་བའི་ལས་བྱས་སོ་ཞེས་འཛེར་ཏོ། །
en: how good it is. What a magnificent austerity you undertook!’

source: བྱང་ཆུབ་སེམས་དཔའ་འདིས་མཆོག་ཏུ་དཀའ་བ་བྱས་ཏེ།
en: ‘This bodhisattva took on extraordinary hardship.

source: བདག་གིས་འདིའི་ལུས་སྔ་མཁོ་བཞིན་དུ་བསྒྱུར་བར་ནི་ནུས་མོད་ཀྱིས། འོན་ཀྱང་བདག་གིས་འདི་ཉིད་ཀྱི་སྤྲོ་བ་ཚོད་ཟིན་པར་བསྐྱེད་དགོས་སོ་སྙམ་ནས།
en: I can restore his body, but first I must finish measuring his commitment.’

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ།
en: So he asked the Bodhisattva,

source: གྲོགས་པོ་ཁྱོད་བདག་གིས་ཤ་རྣམས་གཅོད་ཅིང་རྒྱུས་པ་དང་། རྩ་བྲང་བྲེང་རྣམས་གསེ་བ་ན། སེམས་མི་དགའ་བ་ཅུང་ཟད་ཙམ་སྐྱེས་སམ།
en: ‘My friend, are you not even a little unhappy to cut away your own flesh and to sever your sinews and veins?’

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། གྲོགས་པོ་བདག་གི་ཤ་རྣམས་གཅོད་ཅིང་། རྒྱུས་པ་དང་རྩ་བྲང་བྲེང་རྣམས་གསེ་བ་ན། སེམས་མི་དགའ་བ་ཅུང་ཟད་ཀྱང་མ་སྐྱེས་ཀྱིས།
en: “ ‘Oh, I’m not the least bit unhappy to cut away my flesh or to sever my sinews and veins,’ the Bodhisattva replied.

source: བདག་གིས་སྡུག་བསྔལ་མྱོང་བ་ན། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་། ཡི་དགས་སུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་འབའ་ཞིག་ལ། སྙིང་རྗེའི་དབང་དུ་གྱུར་ཏོ། །
en: ‘I am compelled to undergo this suffering by compassion for beings born as hell beings, animals, or anguished spirits.’

source: གྲོགས་པོ་ཁྱོད་ཀྱི་ཚིག་དེ་ལ་སུ་ཞིག་ཡིད་ཆེས།
en: ‘Who could believe your words, my friend?’

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། བདག་གིས་ཁྱོད་ལ་བདེན་པ་བསྐུལ་བ་དེ་ལྟ་བུས་ཡིད་ཆེས་པར་བསྟན་ཏོ། །
en: “ ‘With an invocation of the truth, I shall bring you to believe them,’ the Bodhisattva replied.

source: བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། དེ་ལྟར་ཁྱོད་ཀྱིས་བདེན་པ་བསྐུལ་བར་ཆད་ན། ཇེ་ཁྱོད་བདག་གིས་ལུས་འདི་བདེན་པ་བསྐུལ་བས་སྔ་མཁོ་བཞིན་དུ་གྱུར་ཅིག །
en: “ ‘If your invocation is true, may your body be as it was before,’ said Śakra.

source: དེ་སྐད་ཅེས་སྨྲས་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ།
en: And just as he said this, the Bodhisattva stated,

source: བདེན་པ་དང་བདེན་པའི་ཚིག་གང་གིས་འདི་ལྟར་བདག་གི་ཤ་རྣམས་གཅོད་ཅིང་། རྒྱུས་པ་དང་རྩ་བྲང་བྲེང་རྣམས་གསེ་བ་ན། སེམས་ཅུང་ཟད་ཙམ་ཡང་མི་དགའ་མ་སྐྱེས་ཏེ།
en: ‘If it is true that I’m not the least bit unhappy to cut away my flesh and to sever my sinews and veins,

source: བདག་གིས་སྡུག་བསྔལ་མྱོང་བ་ན། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་། ཡི་དགས་སུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་འབའ་ཞིག་ལ་སྙིང་རྗེ་བའི་དབང་དུ་གྱུར་ན།
en: and that I am compelled to undergo this suffering by compassion for beings born as hell beings, animals, or anguished spirits,

source: བདེན་པ་དང་བདེན་པའི་ཚིག་དེ་དག་གིས་བདག་གི་ལུས་སྔ་མཁོ་བཞིན་དུ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: then by these words of truth may my body be restored.’

source: དེ་སྐད་ཅེས་བརྗོད་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་སྔ་མཁོ་བཞིན་དུ་གྱུར་ཏོ། །
en: As soon as the Bodhisattva said this, his body was restored.

source: དེ་ནས་དེ་མཐོང་མ་ཐག་ཏུ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ཡི་རངས་ཏེ།
en: “Śakra, King of the Gods, rejoiced at this sight.

source: ཆ་ལུགས་མི་སྣང་བར་བྱས་ནས།
en: His guise disappeared,

source: རང་བཞིན་གྱི་གཟུགས་སུ་བསྒྱུར་ཏེ།
en: and he returned to his natural body.

source: བྱང་ཆུབ་སེམས་དཔའི་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་སྨྲས་པ།
en: He bowed down at the feet of the Bodhisattva and told him,

source: བདག་གིས་ཁྱོད་ལ་གནོད་པའི་བསམས་པས་མི་དགའ་བ་བྱས་པ་ནི་མ་ཡིན་གྱིས།
en: ‘It was not with ill intent that I made such trouble for you.

source: ཁྱོད་ཉིད་ཀྱི་སྤྲོ་བ་བསྐྱེད་པའི་ཕྱིར་བདག་གིས་ཁྱོད་མི་དགའ་བར་བྱས་པར་ཟད་དོ། །
en: I made such trouble for you to spur you on.

source: ཁྱོད་ཀྱི་བརྩོན་འགྲུས་འདི་འདྲ་བ་དང་། སྤྲོ་བ་འདི་འདྲ་བ་ལས་ན། གདོན་མི་ཟ་བར་ཁྱོད་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་གྱིས།
en: With such joyous effort as you possess, you are certain to fully, completely awaken into total and complete enlightenment.

source: དེའི་ཚེ་བདག་དྲན་པར་མཛོད་ཅིག །
en: When you do, please remember me.’

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་ལ་བཟོད་པ་གསོལ་ནས། དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: Then Śakra, King of the Gods, asked forgiveness of the bodhisattva, and disappeared on the spot.

source: དེའི་ཚེ་རྒྱལ་པོ་ཤི་བིར་གྱུར་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ཏེ།
en: I am the one who was King Śibi then, and lived the life of a bodhisattva.

source: དེའི་ཚེ་ཡང་ང་ལེགས་པར་སྨྲ་བས་སྨྲ་བ་དང་། ལེགས་པར་སྨྲ་བར་འདོད་པར་གྱུར་ན།
en: At that time I was a teacher of pithy teachings, and there I wished to hear a pithy teaching.

source: ད་ལྟར་དེ་བཞིན་གཤེགས་པར་གྱུར་པ་ན་ལེགས་པར་སྨྲ་བས་སྨྲ་བ་དང་། ལེགས་པར་སྨྲ་བར་འདོད་པར་ཅི་སྟེ་མི་མཛད།
en: Having become the Tathāgata, now as well, and in the same way, how would I not be a teacher of pithy teachings, and not wish to hear a pithy teaching myself?

source: དགེ་སློང་དག་ང་ནི་ཆོས་དང་པོ་བྱེད་པ་ཡིན་པའི་ཕྱིར་རོ།། །།
en: Because, monks, it was I who first taught this Dharma.”

source: ཤི་བི་གཉིས་པ་ནི།
en: The Second Story of King Śibi

source: གཏན་ཚིགས་དང་། སྔོན་གྱི་རྒྱུ་སྔ་མ་དང་འདྲ་བ་ལས།
en: The opening rationale and prior cause are the same as above.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ།
en: “Śakra, King of the Gods asked the Bodhisattva,

source: ཁྱོད་ཀྱིས་བདག་གི་སློབ་མ་བྱས་པས་ཅི་ལ་ཕན།
en: ‘What good is it if you’re my disciple?

source: ང་ཁྱོད་ལ་གནོད་པ་ཞིག་ཟེར་གྱིས། གལ་ཏེ་གནོད་པ་དེ་ཁྱོད་ཀྱིས་བྱེད་ཕོད་ན་ནི། དེའི་འོག་ཏུ་ཚིགས་སུ་བཅད་པ་དེ་ངས་ཁྱོད་ལ་བརྗོད་པར་བྱའོ། །
en: I have told you to harm yourself in a certain way. If you dare do it, afterward I shall tell the verse to you.’

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། གྲོགས་པོ་ཚིགས་སུ་བཅད་པ་དེ་ཇེ་བརྗོད་ཅིག་དང་།
en: “ ‘Tell me the verse first, my friend,” the Bodhisattva urged him.

source: ཁྱོད་ཀྱིས་བདག་ལ་གནོད་པ་ཅི་བྱེད་དུ་བཅུག་པ་དེ་དག་ཐམས་ཅད་བདག་གིས་བགྱིའོ། །
en: ‘Then I shall harm myself in all the ways in which you have told me.

source: དེ་སྐད་ཅེས་བརྗོད་མ་ཐག་ཏུ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་མདུན་དུ་ཚིགས་སུ་བཅད་པ་དེ་ཚང་བར་བརྗོད་དོ། །
en: “At this, Śakra, King of the Gods, told the entire verse to the Bodhisattva.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་མི་མ་ཡིན་པའི་ཆ་ལུགས་ཅན་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: Then the Bodhisattva drew down the right shoulder of his upper garment, and bowed toward Śakra, King of the Gods, in nonhuman guise, with palms pressed together.

source: ཚིགས་སུ་བཅད་པ་དེ་ཚང་བར་མནོས་ཏེ། ཡུན་རིང་མོ་ཞིག་ཏུ་ཁ་ཏོན་སྦྱངས་ནས། ཁབ་སོར་བཞི་པ་སྟོང་ཤིང་ལེབ་ལ་བཙུགས་པ་དེ་ལྟ་བུ་ཤིང་ལེབ་གཉིས་ཀྱི་བར་དུ་བདག་ཉིད་ཉལ་ཏེ་འཚིར་བར་བྱེད་དོ། །
en: After he had pondered the entire verse, and had practiced reciting it for a long time, he lay down and began to crush himself between two wooden boards—each board driven through with a thousand nails, each nail four fingers in length.

source: དེ་དེ་ན་འདུག་བཞིན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་སྟེ།
en: As he lay there he began to pray for unexcelled, total, and complete enlightenment, saying,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན། བདག་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ། སྟོན་པ་མེད་པར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་གྱུར་ཅིག་ཅེས་བྱས་ནས
en: ‘By this root of virtue, may I become a protector for the world’s blind who are without a guide, without any guide at all, without anyone to show them the way—a tathāgata, an arhat, a totally and completely awakened buddha endowed with perfect knowledge and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—a blessed buddha.’

source: དེ་ནས་ཡང་ཤིང་ལེབ་ཀྱི་བར་དུ་བཙིར་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཐམས་ཅད་ལ་ཁྲག་འབབ་པར་གྱུར་ནས། ས་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །
en: “Then the Bodhisattva again crushed himself between the two boards, and as blood began gushing out from all over his body, the earth quaked six different ways.

source: ནམ་མཁའ་ལ་འཁོད་པའི་ལྷ་རྣམས་ཀྱིས་ཀྱང་མེ་ཏོག་གི་ཆར་ཕབ་ནས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ། །
en: The gods who lived in the sky let fall a rain of flowers, exclaiming, ‘How good it is!’ ”

source: ལྷག་མ་རྣམས་ནི་ཤི་བིའི་གཏམ་རྒྱུད་སྔ་མ་བཞིན་དུ་བདེན་པས་བསྐུལ་ནས། ལུས་སྔ་མཁོ་བཞིན་དུ་སོར་ཆུད་པར་གྱུར་པའི་བར་དུ་བརྗོད་པར་བྱའོ།། །།
en: The rest should be told as in the preceding story, beginning with the invocation of the truth on up to and including the restoration of their bodies.

source: ཀཽ་ཤཱཾ་བཱི་ཞེས་བྱ་བ་ནི།
en: Kauśāmbī

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡུལ་ཀཽ་ཤཱཾ་བཱི་ན། ཁྱིམ་བདག་གདངས་ཅན་གྱི་ཀུན་དགའ་ར་བ་ན་བཞུགས་ཏེ། དེའི་ཚེ་ཀཽ་ཤཱཾ་བཱིའི་དགེ་སློང་མ་རུངས་པ་མཐུ་རྩལ་ཆེ་བ། མདོ་སྡེ་འཛིན་པ། འདུལ་བ་འཛིན་པ། མ་མོ་འཛིན་པ། རྩ་འཇིང་ཆེ་བ། གཡོག་འཁོར་མང་བ་ཞིག་གནས་ཏེ།
en: When the Blessed Buddha was staying in the garden of the householder Ghoṣila in Kauśāmbī, there lived a certain Kauśāmbī monk who was a wicked and very powerful holder of sūtra, vinaya, and mātṛkā.

source: དེའི་དགེ་སློང་གྲོགས་པོ་མང་པོ་གཞན་དག་ཀྱང་ཡོད་ལ། དེ་དག་ཀྱང་མ་རུངས་བ། མཐུ་རྩལ་ཆེ་བ། མདོ་སྡེ་འཛིན་པ། འདུལ་བ་འཛིན་པ། མ་མོ་འཛིན་པ། རྩ་འཇིང་ཆེ་བ། གཡོག་འཁོར་མང་བ་ཤ་སྟག་གོ། །
en: He had many adherents and attendants, and many other monk friends who were also nothing but wicked, powerful holders of sūtra, vinaya, and mātṛkā, with many adherents and attendants themselves.

source: ཡུལ་ཡངས་པ་ཅན་གྱི་དགེ་སློང་ཞིག་ཀྱང་ཡུལ་ཀཽ་ཤཱཾ་བཱིར་འོངས་ཏེ།
en: There was also a certain Vaiśālī monk who had come to Kauśāmbī

source: དེ་ཡང་མ་རུངས་པ། མཐུ་རྩལ་ཆེ་བ། མདོ་སྡེ་འཛིན་པ། འདུལ་བ་འཛིན་པ། མ་མོ་འཛིན་པ། རྩ་འཇིང་ཆེ་བ། གཡོག་འཁོར་མང་བ་ཞིག་ཡིན་ལ།
en: and was likewise a wicked, powerful holder of sūtra, vinaya, and mātṛkā, with many adherents and attendants,

source: དེའི་དགེ་སློང་གྲོགས་པོ་གཞན་དག་ཀྱང་ཡོད་ལ། དེ་དག་ཀྱང་མ་རུངས་པ། མཐུ་རྩལ་ཆེ་བ། མདོ་སྡེ་འཛིན་པ། འདུལ་བ་འཛིན་པ། མ་མོ་འཛིན་པ། རྩ་འཇིང་ཆེ་བ། གཡོག་འཁོར་མང་བ་ཤ་སྟག་གོ། །
en: and many other monk friends who were also nothing but wicked, powerful holders of sūtra, vinaya, and mātṛkā, with many adherents and attendants themselves.

source: དེ་ནས་དེ་དེ་དག་དབྱར་གནས་བཅས་ནས། ནང་ཁྲིམས་བཅས་ཏེ།
en: While all of them were in retreat during the rains, they had agreed,

source: བདག་ཅག་གི་ནང་ནས་གང་གིས་ཆུ་ར་སྟོང་པ་ཅི་ཡང་མེད་པ། ཆུ་མེད་པ་མཐོང་ན་དེ་ཉིད་ཀྱིས་དགང་བར་བྱའོ། །ཡང་ན་ཡོ་བྱད་ཀྱི་ཞལ་ཏ་བྱེད་པ་ལ་སྦྲན་པར་བྱའོ། །
en: “If any one of us sees that the water containers are completely empty, with no water whatsoever, that person should fill them, or else inform the one in charge of the utensils.

source: བདག་གིས་ཀྱང་མ་བཀང་ཡོ་བྱད་ཀྱི་ཞལ་ཏ་བྱེད་པ་ལ་ཡང་མ་སྦྲན་ན། དེ་བདག་ཅག་གིས་གཞི་དེ་ལས་ཉེས་པ་འཆགས་སུ་གཞུག་གོ་ཞེས་ཟེར་རོ། །
en: Furthermore, not filling them or not informing the one in charge of the utensils will be cause for punishment.”

source: དེ་ནས་དེར་དབྱར་གནས་བཅས་པ་རྣམས་ཡང་དག་པའི་གཏམ་གཏན་ལ་འབེབས་པ་ན། ཚིག་རྩུབ་པོས་འདྲེས་ནས་གཅིག་ལ་གཅིག་གླགས་འབའ་ཞིག་ལྟ་ཞིང་འཁོད་དོ། །
en: As those who were staying there during the rains were resolving a discussion, they became embroiled in argument and looked for opportunities to harm one another.

source: དེའི་ཚེ་ཁྱིམ་བདག་ཅིག་གིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཁྱིམ་དུ་བཤོས་ལ་སྤྱན་དྲངས་ནས།
en: At that time a certain householder invited the Buddha and the rest of the saṅgha of monks to take their food at his house,

source: བཅོམ་ལྡན་འདས་དགེ་སློང་མང་པོས་ཞམ་རིང་བྱས་ཏེ། ཁྱིམ་བདག་དེའི་ཁྱིམ་དུ་གཤེགས་སོ། །
en: so the Blessed One set out for the householder’s home accompanied by many of the monks, and eventually arrived at the householder’s home.

source: བཅོམ་ལྡན་འདས་གཤེགས་ནས། ཡངས་པ་ཅན་གྱི་དགེ་སློང་དེ་ཆབ་ཁུང་སར་སོང་སྟེ།
en: After the Blessed One left, the Vaiśālī monk went to bathe,

source: བཀྲུ་བཤལ་བྱས་ནས། ཆུ་རའི་ནང་དུ་ཆུ་ཉུང་ངུ་ཞིག་ལས་མ་ལུས་པར་མཐོང་ནས་
en: and after he had washed and rinsed, he saw that there was no more than a little water left in the water container.

source: བསམས་པ།
en: He thought,

source: དགེ་སློང་ཐམས་ཅད་དོང་ཟིན་པས།
en: “The monks have all already gone.

source: ད་ནི་སུ་ཡང་ཆབ་ཁུང་སར་འགྲོ་བ་མེད་ཀྱིས།
en: No one is going to come here to bathe now,

source: ཆུ་ར་འདི་རང་གིས་དགང་བར་ཡང་མི་དགོས། ཡོ་བྱད་ཀྱི་ཞལ་ཏ་བྱེད་པ་ལ་སྦྲན་ཡང་མི་དགོས་སོ་སྙམ་ནས།
en: so there’s no need to fill the water container or to inform the person in charge of the utensils.”

source: དེས་ཆུ་ཉུང་བཞིན་དུ་བོར་ཏེ་སོང་ངོ་། །
en: So he departed, leaving no more than a little water there.

source: དེ་སོང་ནས་རིང་ཞིག་ལོན་པའི་འོག་ཏུ་ཀཽ་ཤཱཾ་བཱིའི་དགེ་སློང་དེ་ཆབ་ཁུང་སར་འགྲོ་བར་ཆས་པ་ལས། དེས་བལྟས་ན་ཆུ་རའི་ནང་ན་ཆུ་ཉུང་ངུ་ཞིག་ལས་མེད་པ་མཐོང་ནས
en: Not long after he had gone, the Kauśāmbī monk came and was preparing to bathe when he saw that there was no more than a little water left.
